tap "buildpacks/tap"
tap "oven-sh/bun"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bear"
brew "binutils"
brew "bottom"
brew "buf"
brew "cdecl"
brew "clang-format"
brew "cloc"
brew "curl"
brew "deno"
brew "docker-completion"
brew "erdtree"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "fzf"
brew "fzy"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "python@3.13"
brew "helix"
brew "htop"
brew "hwatch"
brew "iftop"
brew "inetutils"
brew "ipcalc"
brew "python@3.12"
brew "iproute2mac"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "lazygit"
brew "less"
brew "lima"
brew "llvm"
brew "lua"
brew "make"
brew "mas"
brew "mdp"
brew "mosh"
brew "mpv"
brew "neovim"
brew "nmap"
brew "node"
brew "nushell"
brew "openjdk"
brew "openssh"
brew "pnpm"
brew "procs"
brew "qemu"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup"
brew "slides"
brew "starship"
brew "stow"
brew "tcpdump"
brew "tealdeer"
brew "testdisk"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "unar"
brew "util-linux"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
brew "uv"
brew "wget"
brew "xh"
brew "zig"
brew "zoxide"
brew "zsh"
brew "buildpacks/tap/pack"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "bruno"
cask "burp-suite"
cask "chatgpt"
cask "coderunner"
cask "container"
cask "dash"
cask "discord"
cask "dockdoor"
cask "element"
cask "font-mona-sans"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "jordanbaird-ice"
cask "k6-studio"
cask "keyboardcleantool"
cask "messenger"
cask "orbstack"
cask "parallels"
cask "parallels-toolbox"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "telegram"
cask "thebrowsercompany-dia"
cask "vagrant"
cask "visual-studio-code"
cask "wireshark-app"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Dropover", id: 1355679052
mas "LINE", id: 539883307
mas "Wappalyzer - Technology profiler", id: 1520333300
vscode "aaron-bond.better-comments"
vscode "biomejs.biome"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hackmd.vscode-hackmd"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tsandall.opa"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
