tap "buildpacks/tap"
tap "cirruslabs/cli"
# Simple API client (Postman-like) in your terminal
brew "atac"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# GNU binary tools for native development
brew "binutils"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Turn English phrases to C or C++ declarations
brew "cdecl"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GNU compiler collection
brew "gcc"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Modern alternative to the watch command
brew "hwatch"
# Display an interface's bandwidth usage
brew "iftop"
# GNU utilities for networking
brew "inetutils"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Powerful, lightweight programming language
brew "lua"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Command-line based markdown presentation tool
brew "mdp"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Remote terminal application
brew "mosh"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Fast, disk space efficient package manager
brew "pnpm"
# Generate podman quadlet files from a podman command or compose file
brew "podlet"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Docker and OCI Registry Client in Go and tooling using those libraries
brew "regclient"
# Safe and ergonomic alternative to rm
brew "rip2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# CLI for relational databases and common data file formats
brew "rsql"
# Rust toolchain installer
brew "rustup"
# Terminal based presentation tool
brew "slides"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line packet analyzer
brew "tcpdump"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Powerful free data recovery utility
brew "testdisk"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Collection of Linux utilities
brew "util-linux"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Cross-platform Rust rewrite of the GNU diffutils
brew "uutils-diffutils"
# Cross-platform Rust rewrite of the GNU findutils
brew "uutils-findutils"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Web security testing toolkit
cask "burp-suite"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Multi-language programming editor
cask "coderunner"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Matrix collaboration client
cask "element"
cask "font-mona-sans"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Application for generating k6 test scripts
cask "k6-studio"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Desktop virtualization software
cask "parallels"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Open source virtual/remote desktop application
cask "rustdesk"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Database management tool with AI-powered features
cask "whodb"
# Network protocol analyzer
cask "wireshark-app"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Dropover", id: 1355679052
mas "LINE", id: 539883307
mas "Wappalyzer - Technology profiler", id: 1520333300
mas "Windows App", id: 1295203466
vscode "aaron-bond.better-comments"
vscode "biomejs.biome"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tsandall.opa"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "fd-find"
cargo "ripgrep"
cargo "rustlings"
