tap "buildpacks/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "oven-sh/bun"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bear"
brew "binutils"
brew "bottom"
brew "buf"
brew "python@3.12"
brew "cdecl"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "deno"
brew "erdtree"
brew "fastfetch"
brew "fd"
brew "ncurses"
brew "fish"
brew "fzf"
brew "fzy"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "hatch"
brew "helix"
brew "htop"
brew "hwatch"
brew "iftop"
brew "inetutils"
brew "ipcalc"
brew "iproute2mac"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "less"
brew "llvm"
brew "lsd"
brew "lua"
brew "make"
brew "mdp"
brew "mosh"
brew "n"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openssh"
brew "pdm"
brew "pipx"
brew "procs"
brew "python@3.9"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup"
brew "slides"
brew "starship"
brew "stow"
brew "tcpdump"
brew "tealdeer"
brew "testdisk"
brew "thefuck"
brew "tmux"
brew "unar"
brew "util-linux"
brew "wget"
brew "xh"
brew "zig"
brew "zoxide"
brew "zsh"
brew "buildpacks/tap/pack"
brew "hashicorp/tap/packer"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "arc"
cask "bartender"
cask "burp-suite"
cask "chatgpt"
cask "dash"
cask "discord"
cask "element"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mona-sans"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "insomnia"
cask "keyboardcleantool"
cask "messenger"
cask "orbstack"
cask "parallels"
cask "parallels-access"
cask "parallels-toolbox"
cask "postman"
cask "raycast"
cask "slack"
cask "telegram"
cask "utm"
cask "vagrant"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "wireshark"
cask "zed"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tsandall.opa"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
